m = int(input("chaweret nebismieri ricxvi: "))

for m in range(m):
    print (m)



q = int(input("chaweret nebismieri ricxvi: "))

while q > 0:
    print (q)
    q = q-1


w = 1    

while w < 100 :
    print (w)
    w += 2


for i in range(0,100,2):
    print (i)





    #for loop მუშაობს წინასწარ განსაზღვრული რაოდენობის ჯერ მას ასევე აქვს ნებისმიერი თანმიმდევრობის ერთეულებზე გამეორების შესაძლებლობა როგორიცაა სია ან სტრიქონი
    #while loop-ით ჩვენ შეგვიძლია შევასრულოთ კოდის ბლოკი სანამ პირობა არის true.
    #იტერაციული ცვლადი არის ცვლადი რომელიც იცვლება ყოველ ჯერზე როდესაც ციკლი ასრულებს და აკონტროლებს როდესაც ციკლი დაასრულებს გამეორების ცვლადს

