# 1)შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა ორი რიცხვი შემდეგ კი გამოიტანეთ ამ რიცხვების ნამრავლი.


def nam (num1,num2):
    print(num1 * num2)

nam(5,10)

# 2)შექმენით ფუნქცია რომელსაც გადაეცემა არგუმენტად რიცხვი შემდეგ კი მან უნდა დაგვიბრუნოს ლუწია ეს რიცხვი თუ კენტი.

def ivenorodd(num):
    if num % 2 == 0:
        print("luwia")
    else:
        print("kentia")

ivenorodd(6)

# 3)შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა სახელი და დაბეჭდავს მისთვის მიესალმებას (მაგალითად: "Hello Giorgi"). გამოძახეთ ეს ფუნქცია 2-ჯერ და გადაეცით სხვადასხვა სახელი.

def saxeli(name):
    print("hello",name)

saxeli("nika")
saxeli("saba")


# 4)შექმენით ფუნქცია, რომელიც იღებს ორ სტრინგს და მოახდინეთ კონკატენაცია.

def konkatinacia(name,name1):
    print(name + name1)

konkatinacia("vashli","xeze")